java/scala/basics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>java oop</title>
<!-- 2017-02-26 Sun 13:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dumeng" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">java oop</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. class</a>
<ul>
<li><a href="#sec-1-1">1.1. class inheritance</a></li>
<li><a href="#sec-1-2">1.2. case class</a></li>
</ul>
</li>
<li><a href="#sec-2">2. object</a>
<ul>
<li><a href="#sec-2-1">2.1. trait</a></li>
</ul>
</li>
<li><a href="#sec-3">3. function</a>
<ul>
<li><a href="#sec-3-1">3.1. Parameterless function:</a></li>
<li><a href="#sec-3-2">3.2. parameter call by name</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> class</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">MyClass</span><span style="color: #DCDCCC;">{</span>
<span style="color: #DCDCCC;">}</span>
<span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">MyClass2</span><span style="color: #DCDCCC;">(</span>...args<span style="color: #DCDCCC;">){</span>

<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> class inheritance</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Class1</span> <span style="color: #F0DFAF; font-weight: bold;">extends</span> <span style="color: #7CB8BB;">Base</span><span style="color: #DCDCCC;">{</span>
<span style="color: #DCDCCC;">}</span>
<span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Base2</span><span style="color: #DCDCCC;">(</span>arg1<span style="color: #F0DFAF; font-weight: bold;">:</span><span style="color: #7CB8BB;">Type1</span><span style="color: #DCDCCC;">){</span>
<span style="color: #DCDCCC;">}</span>
<span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Class2</span><span style="color: #DCDCCC;">(</span>arg0<span style="color: #F0DFAF; font-weight: bold;">:</span><span style="color: #7CB8BB;">Type0</span>,arg1<span style="color: #F0DFAF; font-weight: bold;">:</span><span style="color: #7CB8BB;">Type1</span><span style="color: #DCDCCC;">)</span> <span style="color: #F0DFAF; font-weight: bold;">extends</span> <span style="color: #7CB8BB;">Base2</span><span style="color: #DCDCCC;">(</span>arg1<span style="color: #DCDCCC;">){</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> case class</h3>
<div class="outline-text-3" id="text-1-2">
<p>
case class is a little like the enumeration in swift. Swift extends the enumeration and struct to make them have ability like class, while scala use a prifix `case` to make a class behave like enumeration.
The parameters in a case class constructor will be a member variable, like mark `var` or `val` in an ordinary class constructor.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> object</h2>
<div class="outline-text-2" id="text-2">
<p>
Object is a singleton class.
You can also use <b>case</b> to decorate it.
</p>

<p>
Object is designed to replace <b>static</b> in java.
Since Object is just an object, you can move the class static method like factory method in traditional class declaration to the object body.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> trait</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The <b>trait</b> is like interface in java and protocal of swift.
You can use trait to achieve multiple inheritance.
</p>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">FinalClass</span> <span style="color: #F0DFAF; font-weight: bold;">extends</span> <span style="color: #7CB8BB;">Base</span> <span style="color: #F0DFAF; font-weight: bold;">with</span> <span style="color: #7CB8BB;">Trait0</span> <span style="color: #F0DFAF; font-weight: bold;">with</span> <span style="color: #7CB8BB;">Trait1</span> <span style="color: #DCDCCC;">{</span>

<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<hr  />
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> function</h2>
<div class="outline-text-2" id="text-3">
<p>
Normal defination:
</p>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">func</span><span style="color: #DCDCCC;">(</span>x<span style="color: #F0DFAF; font-weight: bold;">:</span><span style="color: #7CB8BB;">Int</span><span style="color: #DCDCCC;">)</span><span style="color: #F0DFAF; font-weight: bold;">:</span><span style="color: #7CB8BB;">Int</span> <span style="color: #F0DFAF; font-weight: bold;">=</span> x*x
</pre>
</div>

<p>
Enormous function:
</p>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">enor</span> <span style="color: #F0DFAF; font-weight: bold;">=</span> <span style="color: #DCDCCC;">(</span>x<span style="color: #F0DFAF; font-weight: bold;">:</span><span style="color: #7CB8BB;">Int</span><span style="color: #DCDCCC;">)</span><span style="color: #F0DFAF; font-weight: bold;">=&gt;</span>x*x
<span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">or</span>
<span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">enor</span> <span style="color: #F0DFAF; font-weight: bold;">=</span> <span style="color: #DCDCCC;">(</span>x<span style="color: #F0DFAF; font-weight: bold;">:</span><span style="color: #7CB8BB;">Int</span><span style="color: #DCDCCC;">)</span><span style="color: #F0DFAF; font-weight: bold;">=&gt;</span>x*x
</pre>
</div>

<blockquote>
<p>
The difference between <b>def</b> and <b>val</b>: def will not evaluate the right-side expression when defined, instead it will be evaluated immedeatily when called.
</p>
</blockquote>
</div>


<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Parameterless function:</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #D0BF8F; font-weight: bold;">x</span> <span style="color: #F0DFAF; font-weight: bold;">=</span> <span style="color: #BFEBBF;">3</span>
<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">less</span> <span style="color: #F0DFAF; font-weight: bold;">=</span> x*x
</pre>
</div>

<blockquote>
<p>
 Just like the computed variable in swift, the parameterless function can be called as `less`.
You can define with an empty <code>()</code>:
</p>

<div class="org-src-container">

<pre class="src src-scala"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">less</span><span style="color: #DCDCCC;">()</span><span style="color: #F0DFAF; font-weight: bold;">=</span>x*x
</pre>
</div>

<p>
Then you can call it by <code>less</code> or <code>less()</code>.
</p>
</blockquote>

<p>
<b>Note</b>: This is the principle called <b>uniform access principle</b>, which states that variables and parameterless functions should be accessed using the same syntax.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> parameter call by name</h3>
<div class="outline-text-3" id="text-3-2">
<p>
By default the parameter in function is called by value, which means then will be evaluated before execute the function body.
You can :
</p>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">func</span><span style="color: #DCDCCC;">(</span>x<span style="color: #F0DFAF; font-weight: bold;">:</span><span style="color: #7CB8BB;">Int</span>, y<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #F0DFAF; font-weight: bold;">=&gt;</span> <span style="color: #BFEBBF;">Int</span><span style="color: #DCDCCC;">)</span><span style="color: #F0DFAF; font-weight: bold;">=</span><span style="color: #DCDCCC;">{</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
<p>
to make the <code>y</code> called by name.
</p>

<p>
<b>warning</b>: The <code>=&gt;</code> should has a space before it. Because the <code>=&gt;Int</code> is in fact a function: <code>()=&gt;Int</code>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: dumeng</p>
<p class="date">Created: 2017-02-26 Sun 13:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"></p>
</div>
</body>
</html>
